tap "databricks/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Library to render SVG files using Cairo
brew "librsvg"
# Download with resuming and segmented downloading
brew "aria2"
# Message bus system, providing inter-application communication
brew "dbus"
# GNU compiler collection
brew "gcc"
# Extract annotations from audio signals
brew "aubio"
# Shell extension to jump to frequently used directories
brew "autojump"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Python code formatter
brew "black"
# New way to see and navigate directory trees
brew "broot"
# Object-file caching compiler wrapper
brew "ccache"
# Hyperfast web frontend for Git repositories written in C
brew "cgit"
# Fuzzy matcher that uses std{in,out} and a native GUI
brew "choose-gui"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Identify or delete duplicate files
brew "fdupes"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Highly customizable changelog generator
brew "git-cliff"
# Small git utilities
brew "git-extras"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# GNOME GUI client to view git repositories
brew "gitg"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# File format designed to store large amounts of data
brew "hdf5"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Convert images to PDF via direct JPEG inclusion
brew "img2pdf"
# Enhanced version of john, a UNIX password cracker
brew "john-jumbo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Implementation of the file(1) command
brew "libmagic"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Platform built on V8 to build network applications
brew "node"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Interpreter for the AWK Programming Language
brew "mawk"
# Fast Cross-Platform Package Manager
brew "micromamba"
# Terminal-based visual file manager
brew "midnight-commander"
# Powerful paging program
brew "most"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Development kit for the Java programming language
brew "openjdk@11"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Generate Postscript calendars without X
brew "pcal"
# Port of pdftk in java
brew "pdftk-java"
# Modern Python package and dependency manager supporting the latest PEP standards
brew "pdm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Static type checker for Python
brew "pyright"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Python interface to Tcl/Tk
brew "python-tk@3.12"
# File browser
brew "ranger"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Utility that provides fast incremental file transfer
brew "rsync"
# Ncurses BitTorrent client based on libtorrent-rakshasa
brew "rtorrent"
# Extremely fast Python linter, written in Rust
brew "ruff"
# SMB/CIFS file, print, and login server for UNIX
brew "samba"
# Fully featured SFTP server with optional HTTP/S, FTP/S and WebDAV support
brew "sftpgo"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Text interface for Git repositories
brew "tig"
# Terminal image and video viewer
brew "timg"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Source code spell checker
brew "typos-cli"
# Markup-based typesetting system
brew "typst"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Dumb downloader that scrapes the web
brew "you-get"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Command-line interface for the Databricks platform
brew "databricks/tap/databricks"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Memory training application
cask "anki"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Display management tool
cask "betterdisplay"
# Opensource IDE for exploring and testing api's
cask "bruno"
# E-books management software
cask "calibre"
# Free and open-source web browser
cask "chromium"
# Server and cloud storage browser
cask "cyberduck"
# Developer platform
cask "dotnet-sdk"
# File manager with two panels
cask "double-commander"
# Online diagram software
cask "drawio"
# Finds duplicate files in a computer system
cask "dupeguru"
cask "fman"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
cask "gifcapture"
# Free and open-source image editor
cask "gimp"
# Genealogy software
cask "gramps"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Desktop automation application
cask "hammerspoon"
# Chat client for models on HuggingFace
cask "huggingchat"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Keyboard customiser
cask "karabiner-elements"
# Password manager app
cask "keepassxc"
# Open source code editor written in Rust
cask "lapce"
# Extensible two-pane file manager
cask "marta"
# Visual diff and merge tool
cask "meld"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Open-source software for live streaming and screen recording
cask "obs"
# Simple Gtk# Paint Program
cask "pinta"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Image viewer
cask "qview"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Video editor
cask "shotcut"
# EPUB ebook editor
cask "sigil"
# System monitor for the menu bar
cask "stats"
# Git client
cask "sublime-merge"
# Customizable timing of breaks
cask "time-out"
# Rust-based terminal
cask "warp"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Create diagrams manually, or import external data for analysis
cask "yed"
# Multiplayer code editor
cask "zed"
vscode "10nates.ollama-autocoder"
vscode "adamvoss.vscode-languagetool"
vscode "adamvoss.vscode-languagetool-en"
vscode "adamvoss.vscode-languagetool-es"
vscode "adamvoss.vscode-languagetool-pl"
vscode "akamud.vscode-theme-onelight"
vscode "alanwalk.markdown-navigation"
vscode "alefragnani.project-manager"
vscode "apertia.vscode-aider"
vscode "bbenoist.shell"
vscode "bhargavdetroja.export-your-extensions"
vscode "bierner.markdown-mermaid"
vscode "bmalehorn.shell-syntax"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "cameron.vscode-pytest"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "csholmq.excel-to-markdown-table"
vscode "darkriszty.markdown-table-prettify"
vscode "databricks.databricks"
vscode "davidanson.vscode-markdownlint"
vscode "docsmsft.docs-yaml"
vscode "donaldpittard.gpt-3-token-counter"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.vscode-jupytext"
vscode "editorconfig.editorconfig"
vscode "eliostruyf.vscode-demo-time"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "fredarcito.pomodoro-buddy"
vscode "garytyler.darcula-pycharm"
vscode "geeklearningio.graphviz-markdown-preview"
vscode "gera2ld.markmap-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "howardzuo.vscode-favorites"
vscode "iamhyc.overleaf-workshop"
vscode "irongeek.vscode-env"
vscode "james-yu.latex-workshop"
vscode "k--kato.intellij-idea-keybindings"
vscode "kevinrose.vsc-python-indent"
vscode "kosz78.nim"
vscode "leodevbro.blockman"
vscode "magicstack.magicpython"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "michelemelluso.gitignore"
vscode "mikestead.dotenv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.gather"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.prompty"
vscode "ms-toolsai.vscode-ai-remote"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "myriad-dreamin.tinymist"
vscode "nixon.env-cmd-file-syntax"
vscode "nvarner.typst-lsp"
vscode "obrejla.netbeans-light-theme"
vscode "ouweiya.copy-file-name"
vscode "pamaron.pytest-runner"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "quarto.quarto"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "rodolphebarbanneau.python-docstring-highlighter"
vscode "sametcn99.env-protector"
vscode "sdras.night-owl"
vscode "seitotanaka.vscode-pomodoro-edit"
vscode "shardulm94.trailing-spaces"
vscode "shyykoserhiy.git-autoconfig"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "timonwong.shellcheck"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tomoki1207.pdf"
vscode "twixes.pypi-assistant"
vscode "tyriar.lorem-ipsum"
vscode "unmannedaero.markdown-yaml-frontpage"
vscode "valentjn.vscode-ltex"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wekex.jsonlint"
vscode "xelad0m.jupyter-toc"
vscode "yahya-gilany.vscode-pomodoro"
vscode "yzhang.markdown-all-in-one"
vscode "zaaack.markdown-editor"
vscode "zainchen.json"
vscode "zddq.aut-icons"
