tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "yt-dlp/taps"
brew "gettext"
brew "glib"
brew "pkg-config"
brew "python@3.9"
brew "cairo"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "bash"
brew "bat"
brew "bfg"
brew "black"
brew "c-blosc"
brew "choose-gui"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diff-pdf"
brew "diff-so-fancy"
brew "libmagic"
brew "diffoscope"
brew "difftastic"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "exa"
brew "fasd"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fping"
brew "fswatch"
brew "gdmap"
brew "ghostscript"
brew "gtk+3"
brew "imagemagick"
brew "geeqie"
brew "gh"
brew "git"
brew "git-gui"
brew "gitwatch"
brew "glances"
brew "grc"
brew "hdf5"
brew "htop"
brew "httrack"
brew "hugo"
brew "hyperkit"
brew "jq"
brew "kubernetes-cli"
brew "lepton"
brew "libxft"
brew "qemu"
brew "lima"
brew "mas"
brew "mawk"
brew "midnight-commander"
brew "most"
brew "navi"
brew "neofetch"
brew "neovim"
brew "node"
brew "nvm"
brew "ocrmypdf"
brew "openssh"
brew "pandoc"
brew "parallel"
brew "pcal"
brew "pipenv"
brew "podman"
brew "poetry"
brew "prettier"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygobject3"
brew "ranger"
brew "ripgrep"
brew "rsync"
brew "sevenzip"
brew "shellcheck"
brew "sphinx-doc"
brew "syncthing"
brew "ta-lib", link: false
brew "tesseract-lang"
brew "the_silver_searcher"
brew "tig"
brew "tkdiff"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yank"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "derailed/k9s/k9s"
brew "koekeishiya/formulae/yabai"
brew "yt-dlp/taps/yt-dlp", link: false
cask "amethyst"
cask "anki"
cask "awareness"
cask "beyond-compare"
cask "bitbar"
cask "brave-browser"
cask "diffmerge"
cask "firealpaca"
cask "fman"
cask "font-fira-code"
cask "gifcapture"
cask "google-cloud-sdk"
cask "gramps"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "keepassxc"
cask "lepton"
cask "mactex"
cask "marta"
cask "mono-mdk"
cask "nimblenote"
cask "obs"
cask "olive"
cask "pinta"
cask "poedit"
cask "postman"
cask "pycharm"
cask "shiftit"
cask "skype"
cask "stats"
cask "sublime-merge"
cask "sublime-text"
cask "time-out"
cask "typora"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "xnviewmp"
cask "xquartz"
